<a href="https://colab.research.google.com/gist/AnasAito/6e80b883c4ad57737b1bfece9ac60d5b/lab-2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# SQL with Python
This lab introduces SQL using Python and SQLite, a lightweight database system. You will learn how to:
- Connect to an SQLite database.
- Create tables and insert data.
- Perform batch data insertion.
- Query the database.

SQLite is ideal for learning as it requires no additional setup and comes pre-installed with Python.

## Install and Import Dependencies
SQLite is included with Python, so no additional installation is required. However, we'll use pandas for CSV manipulation.

In [2]:
import sqlite3
import pandas as pd

## Connect to SQLite Database
We'll create or connect to an SQLite database file named `lab_2.db`. If the file doesn't exist, SQLite will create it.

In [10]:
# Connect to SQLite database
connection = sqlite3.connect("lab_2.db")

# Create a cursor object to execute SQL commands
cursor = connection.cursor()

print("Database connection established.")

Database connection established.

## Creating a Table
We'll create a table called `Students` with the following schema:
- `ID`: INTEGER, Primary Key
- `Name`: TEXT
- `Age`: INTEGER
- `Grade`: TEXT

In [11]:
# Create a table
create_table_query = '''
CREATE TABLE IF NOT EXISTS Students (
    ID INTEGER PRIMARY KEY,
    Name TEXT,
    Age INTEGER,
    Grade TEXT
);
'''
cursor.execute(create_table_query)
connection.commit()

print("Table 'Students' created successfully.")

Table 'Students' created successfully.

## Inserting Data
Insert a few records into the `Students` table.

In [12]:

insert_query = '''
INSERT INTO Students (Name, Age, Grade)
VALUES (?, ?, ?);
'''

# data
students_data = [
    ('Alice', 20, 'A'),
    ('Bob', 22, 'B'),
    ('Charlie', 21, 'A'),
]


cursor.executemany(insert_query, students_data)
connection.commit()

print("Records inserted successfully.")

Records inserted successfully.

## Querying Data
Use SQL SELECT queries to retrieve data from the `Students` table.

In [13]:
# Retrieve data
query = "SELECT * FROM Students;"
cursor.execute(query)

# Fetch and display results
results = cursor.fetchall()
for row in results:
    print(row)

(1, 'Alice', 20, 'A')
(2, 'Bob', 22, 'B')
(3, 'Charlie', 21, 'A')
(4, 'Alice', 20, 'A')
(5, 'Bob', 22, 'B')
(6, 'Charlie', 21, 'A')

## Batch Insertion
We will load data into a new table named `Employees`.
The should contain the following columns:
- `ID` (INTEGER)
- `Name` (TEXT)
- `Position` (TEXT)
- `Salary` (REAL)

Let's create the `Employees` table and write data to table .

In [16]:
# Create Employees table
create_employees_table = '''
CREATE TABLE IF NOT EXISTS Employees (
    ID INTEGER PRIMARY KEY,
    Name TEXT,
    Position TEXT,
    Salary REAL
);
'''
cursor.execute(create_employees_table)

#data
csv_data = [
    (1, 'John Doe', 'Manager', 75000.0),
    (2, 'Jane Smith', 'Developer', 65000.0),
    (3, 'Emily Davis', 'Designer', 50000.0),
]

# Insert data into Employees table
insert_employees_query = '''
INSERT INTO Employees (ID, Name, Position, Salary)
VALUES (?, ?, ?, ?);
'''

cursor.executemany(insert_employees_query, csv_data)
connection.commit()

print("Data loaded from CSV and inserted into 'Employees' table.")

Data loaded from CSV and inserted into 'Employees' table.

## Query Examples
Let's perform some queries:
1. Retrieve all employees earning more than $60,000.
2. Count the number of employees.

In [7]:
# Query: Employees earning more than $60,000
query_high_salary = "SELECT * FROM Employees WHERE Salary > 60000;"
cursor.execute(query_high_salary)
# we use fetch all when we have multiple rows as output
high_salary_employees = cursor.fetchall()
print("Employees earning more than $60,000:")
for emp in high_salary_employees:
    print(emp)

# Query: Count the number of employees
query_count = "SELECT COUNT(*) FROM Employees;"
cursor.execute(query_count)
# we use fetch all when we have multiple rows as output
employee_count = cursor.fetchone()[0]
print(f"Total number of employees: {employee_count}")

Employees earning more than $60,000:
(1, 'John Doe', 'Manager', 75000.0)
(2, 'Jane Smith', 'Developer', 65000.0)
Total number of employees: 3

## Closing the Database Connection
Always close the database connection when you're done to ensure data integrity.

In [8]:
# Close the connection
connection.close()
print("Database connection closed.")

Database connection closed.

# It is your turn !
## **Lab: Transform ER Diagram seen in Exercise 2.3 into SQL Tables**

### **Objective**
The goal of this lab is to transform the given ER diagram into SQL tables, populate the tables with sample data, and write SQL queries to answer specific questions.

---

### **Instructions**


1. **Create SQL Tables**  
   - Use `CREATE TABLE` statements to define tables for each entity and relationship.  
   - Ensure proper use of primary keys, foreign keys, and data types.

2. **Insert Sample Data**  
   - Populate each table with at least 5–10 rows of sample data.

3. **Write SQL Queries**  
   - Use SQL queries to answer the provided questions.

---

### **Questions**

1. **List all professors and their research specialties.**  

2. **Retrieve all projects managed by a specific professor.**  

3. **Find the names of graduate students working on a specific project.**  

4. **Find professors supervising graduate students on a specific project.**  

5. **Count how many professors work in each department.**  

6. **List graduate students and their advisors.**  

7. **Find all projects with a budget greater than $1,000,000.**  

8. **Retrieve all departments and their chairmen.**  

9. **Find the total number of projects a specific professor is managing.**  

10. **Find the names of graduate students and their major department.**

## 1. Create and Connect Database

In [1]:
import sqlite3
import pandas as pd

In [2]:
# Connect to SQLite database
connection = sqlite3.connect("lab_2_questions.db")

# Create a cursor object to execute SQL commands
cursor = connection.cursor()

print("Database connection established.")

Database connection established.

## 2. Create tables based on the ER diagram

In [3]:
with connection as conn:
    create_statements = {
        "Professor": 
        """CREATE TABLE IF NOT EXISTS Professor (
            prof_ssn CHAR,
            name CHAR,
            age INTEGER,
            rank INTEGER,
            speciality CHAR,
            PRIMARY KEY (prof_ssn)
        );""",
        # Create Professor table first
        "Dept": 
        """CREATE TABLE IF NOT EXISTS Dept (
            dno INTEGER,
            office VARCHAR,
            dname VARCHAR,
            prof_ssn CHAR UNIQUE,
            PRIMARY KEY (dno),
            FOREIGN KEY (prof_ssn) REFERENCES Professor(prof_ssn) ON DELETE NO ACTION
        );""",
        # Create Dept table next
        "Work_dept":
        """CREATE TABLE IF NOT EXISTS Work_dept (
            prof_ssn CHAR,
            dno INTEGER,
            pc_time REAL,
            PRIMARY KEY (prof_ssn, dno),
            FOREIGN KEY (prof_ssn) REFERENCES Professor(prof_ssn),
            FOREIGN KEY (dno) REFERENCES Dept(dno)
        );""",
        # Continue with the rest of the tables
        "Project": 
        """CREATE TABLE IF NOT EXISTS Project (
            pid INTEGER,
            start_date DATE,
            end_date DATE,
            budget REAL,
            ssn CHAR,
            sponsor CHAR,
            PRIMARY KEY (pid),
            FOREIGN KEY (ssn) REFERENCES Professor(prof_ssn)
        );""",
        "Works_in": 
        """CREATE TABLE IF NOT EXISTS Works_in (
            prof_ssn CHAR,
            pid INTEGER,
            PRIMARY KEY (pid, prof_ssn),
            FOREIGN KEY (pid) REFERENCES Project(pid),
            FOREIGN KEY (prof_ssn) REFERENCES Professor(prof_ssn)
        );""",
        "Graduate": 
        """CREATE TABLE IF NOT EXISTS Graduate (
            grad_ssn CHAR,
            age INTEGER,
            name VARCHAR,
            deg_prog VARCHAR,
            major INTEGER NOT NULL ,
            PRIMARY KEY (grad_ssn),
            FOREIGN KEY (major) REFERENCES Dept(dno)
        );""",
        "Supervises": 
        """CREATE TABLE IF NOT EXISTS Supervises (
            prof_ssn CHAR,
            grad_ssn CHAR,
            pid INTEGER,
            PRIMARY KEY (pid, prof_ssn, grad_ssn),
            FOREIGN KEY (pid) REFERENCES Project(pid),
            FOREIGN KEY (prof_ssn) REFERENCES Professor(prof_ssn),
            FOREIGN KEY (grad_ssn) REFERENCES Graduate(grad_ssn)
        );""",
        "Manages": 
        """CREATE TABLE IF NOT EXISTS Manages (
            pid INTEGER,
            prof_ssn CHAR,
            PRIMARY KEY (pid, prof_ssn),
            FOREIGN KEY (prof_ssn) REFERENCES Professor(prof_ssn),
            FOREIGN KEY (pid) REFERENCES Project(pid)
        );""",
        "Advisor": 
        """CREATE TABLE IF NOT EXISTS Advisor (
            senior_ssn CHAR,
            grad_ssn CHAR,
            PRIMARY KEY (senior_ssn, grad_ssn),
            FOREIGN KEY (senior_ssn) REFERENCES Graduate(grad_ssn),
            FOREIGN KEY (grad_ssn) REFERENCES Graduate(grad_ssn)
        );"""
    }
    for table_name, create_statement in create_statements.items():
        cursor.execute(create_statement)
        connection.commit()
        print(f"Table {table_name} created successfully.")

Table Professor created successfully.
Table Dept created successfully.
Table Work_dept created successfully.
Table Project created successfully.
Table Works_in created successfully.
Table Graduate created successfully.
Table Supervises created successfully.
Table Manages created successfully.
Table Advisor created successfully.

## 3. Create dummy data to fill in the tables

In [4]:
# First, insert Professors
professor_data = [
    ('P001', 'John Smith', 45, 1, 'Database Systems'),
    ('P002', 'Mary Johnson', 52, 2, 'Machine Learning'),
    ('P003', 'Robert Brown', 38, 1, 'Cybersecurity'),
    ('P004', 'Sarah Davis', 41, 2, 'Artificial Intelligence'),
    ('P005', 'Michael Wilson', 55, 3, 'Software Engineering'),
    ('P006', 'Emma Thompson', 47, 2, 'Computer Networks'),
    ('P007', 'David Miller', 50, 3, 'Data Mining'),
    ('P008', 'Lisa Anderson', 43, 1, 'Cloud Computing'),
    ('P009', 'James Taylor', 39, 2, 'Web Technologies'),
    ('P010', 'Patricia Moore', 46, 3, 'Computer Graphics'),
    ('P011', 'Richard Lee', 51, 3, 'Robotics'),
    ('P012', 'Jennifer White', 44, 2, 'Human-Computer Interaction'),
    ('P013', 'Thomas Martin', 49, 1, 'Computer Vision'),
    ('P014', 'Elizabeth Clark', 42, 2, 'Natural Language Processing'),
    ('P015', 'William Wright', 53, 3, 'Quantum Computing')
]

cursor.executemany('''
    INSERT INTO Professor (prof_ssn, name, age, rank, speciality)
    VALUES (?, ?, ?, ?, ?)
''', professor_data)

# Departments
dept_data = [
    (1, 'Room 101', 'Computer Science', 'P001'),
    (2, 'Room 201', 'Data Science', 'P002'),
    (3, 'Room 301', 'Software Engineering', 'P003'),
    (4, 'Room 401', 'Cybersecurity', 'P004'),
    (5, 'Room 501', 'Artificial Intelligence', 'P005'),
    (6, 'Room 601', 'Robotics', 'P011'),
    (7, 'Room 701', 'Digital Media', 'P010'),
    (8, 'Room 801', 'Information Systems', 'P007')
]

cursor.executemany('''
    INSERT INTO Dept (dno, office, dname, prof_ssn)
    VALUES (?, ?, ?, ?)
''', dept_data)

# Work_dept relationships (professors working in multiple departments)
work_dept_data = [
    ('P001', 1, 0.8), ('P001', 2, 0.2),  # Professor working in two departments
    ('P002', 2, 0.7), ('P002', 5, 0.3),
    ('P003', 3, 0.9), ('P003', 4, 0.1),
    ('P004', 4, 0.6), ('P004', 5, 0.4),
    ('P005', 5, 0.8), ('P005', 3, 0.2),
    ('P006', 1, 0.5), ('P006', 4, 0.5),
    ('P007', 2, 0.7), ('P007', 8, 0.3),
    ('P008', 3, 0.6), ('P008', 1, 0.4),
    ('P009', 4, 0.8), ('P009', 2, 0.2),
    ('P010', 7, 0.9), ('P010', 5, 0.1),
    ('P011', 6, 1.0),
    ('P012', 1, 0.6), ('P012', 7, 0.4),
    ('P013', 5, 0.7), ('P013', 6, 0.3),
    ('P014', 2, 0.8), ('P014', 8, 0.2),
    ('P015', 3, 0.5), ('P015', 6, 0.5)
]

cursor.executemany('''
    INSERT INTO Work_dept (prof_ssn, dno, pc_time)
    VALUES (?, ?, ?)
''', work_dept_data)

# Projects
project_data = [
    (1, '2023-01-01', '2024-01-01', 1500000.0, 'P001', 'Google'),
    (2, '2023-02-01', '2024-06-01', 800000.0, 'P002', 'Microsoft'),
    (3, '2023-03-15', '2024-03-15', 2200000.0, 'P003', 'Amazon'),
    (4, '2023-04-01', '2024-12-01', 2000000.0, 'P004', 'Apple'),
    (5, '2023-05-01', '2024-05-01', 900000.0, 'P005', 'Meta'),
    (6, '2023-06-01', '2024-08-01', 1100000.0, 'P006', 'IBM'),
    (7, '2023-07-01', '2024-07-01', 750000.0, 'P007', 'Oracle'),
    (8, '2023-08-01', '2024-04-01', 1300000.0, 'P008', 'Intel'),
    (9, '2023-09-01', '2024-09-01', 950000.0, 'P009', 'NVIDIA'),
    (10, '2023-10-01', '2024-10-01', 1700000.0, 'P010', 'AMD'),
    (11, '2023-11-01', '2024-11-01', 2500000.0, 'P011', 'Tesla'),
    (12, '2023-12-01', '2024-12-01', 1800000.0, 'P012', 'SpaceX'),
    (13, '2024-01-01', '2025-01-01', 1600000.0, 'P013', 'Samsung'),
    (14, '2024-02-01', '2025-02-01', 1900000.0, 'P014', 'Huawei'),
    (15, '2024-03-01', '2025-03-01', 2100000.0, 'P015', 'Sony')
]

cursor.executemany('''
    INSERT INTO Project (pid, start_date, end_date, budget, ssn, sponsor)
    VALUES (?, ?, ?, ?, ?, ?)
''', project_data)

# Graduate students 
graduate_data = [
    ('G001', 25, 'Alex Wilson', 'PhD', 1),
    ('G002', 23, 'Emily Brown', 'MS', 2),
    ('G003', 27, 'Chris Lee', 'PhD', 3),
    ('G004', 24, 'Diana Kim', 'MS', 4),
    ('G005', 26, 'Frank Chen', 'PhD', 5),
    ('G006', 25, 'Grace Liu', 'MS', 1),
    ('G007', 28, 'Henry Park', 'PhD', 2),
    ('G008', 24, 'Isabel Cruz', 'MS', 3),
    ('G009', 26, 'Jack Zhang', 'PhD', 4),
    ('G010', 23, 'Kelly Wong', 'MS', 5),
    ('G011', 25, 'Larry Foster', 'PhD', 6),
    ('G012', 24, 'Monica Patel', 'MS', 7),
    ('G013', 27, 'Nathan Rodriguez', 'PhD', 8),
    ('G014', 26, 'Olivia Thompson', 'MS', 1),
    ('G015', 29, 'Peter Chang', 'PhD', 2),
    ('G016', 23, 'Quinn Martinez', 'MS', 3),
    ('G017', 25, 'Rachel Kim', 'PhD', 4),
    ('G018', 24, 'Steven Johnson', 'MS', 5),
    ('G019', 28, 'Tina Liu', 'PhD', 6),
    ('G020', 26, 'Victor Garcia', 'MS', 7)
]

cursor.executemany('''
    INSERT INTO Graduate (grad_ssn, age, name, deg_prog, major)
    VALUES (?, ?, ?, ?, ?)
''', graduate_data)

# Supervision relationships
supervises_data = [
    ('P001', 'G001', 1), ('P001', 'G006', 1),  # Two students on same project
    ('P002', 'G002', 2), ('P002', 'G007', 2),
    ('P003', 'G003', 3), ('P003', 'G008', 3),
    ('P004', 'G004', 4), ('P004', 'G009', 4),
    ('P005', 'G005', 5), ('P005', 'G010', 5),
    ('P006', 'G011', 6), ('P006', 'G014', 6),
    ('P007', 'G012', 7), ('P007', 'G015', 7),
    ('P008', 'G013', 8), ('P008', 'G016', 8),
    ('P009', 'G017', 9), ('P009', 'G018', 9),
    ('P010', 'G019', 10), ('P010', 'G020', 10)
]

cursor.executemany('''
    INSERT INTO Supervises (prof_ssn, grad_ssn, pid)
    VALUES (?, ?, ?)
''', supervises_data)

# Project management relationships
manages_data = [
    (1, 'P001'), (2, 'P001'),
    (3, 'P002'), (4, 'P002'),
    (5, 'P003'),
    (6, 'P004'),
    (7, 'P005'),
    (8, 'P006'),
    (9, 'P007'),
    (10, 'P008'),
    (11, 'P009'),
    (12, 'P010'),
    (13, 'P011'),
    (14, 'P012'),
    (15, 'P013')
]

cursor.executemany('''
    INSERT INTO Manages (pid, prof_ssn)
    VALUES (?, ?)
''', manages_data)

advisor_data = [
    ('G001', 'G002'), ('G001', 'G006'),  # Senior student advising multiple juniors
    ('G003', 'G004'), ('G003', 'G008'),
    ('G005', 'G010'), ('G005', 'G018'),
    ('G007', 'G012'), ('G007', 'G016'),
    ('G009', 'G014'), ('G009', 'G020'),
    ('G011', 'G015'),
    ('G013', 'G017'),
    ('G015', 'G019')
]

cursor.executemany('''
    INSERT INTO Advisor (senior_ssn, grad_ssn)
    VALUES (?, ?)
''', advisor_data)

# Commit all changes
connection.commit()
print("Sample data inserted successfully into all tables.")

Sample data inserted successfully into all tables.

# Questions (SQL Queries)

### 1. List all professors and their research specialties

In [5]:

query_specialties = "SELECT prof_ssn, name, speciality FROM Professor;"
cursor.execute(query_specialties)

# Get column names from cursor description
columns = [description[0] for description in cursor.description]

# Create DataFrame with results
results_df = pd.DataFrame(cursor.fetchall(), columns=columns)

print("Professors and their specialties:")
display(results_df)

Professors and their specialties:

   prof_ssn             name                   speciality
0      P001       John Smith             Database Systems
1      P002     Mary Johnson             Machine Learning
2      P003     Robert Brown                Cybersecurity
3      P004      Sarah Davis      Artificial Intelligence
4      P005   Michael Wilson         Software Engineering
5      P006    Emma Thompson            Computer Networks
6      P007     David Miller                  Data Mining
7      P008    Lisa Anderson              Cloud Computing
8      P009     James Taylor             Web Technologies
9      P010   Patricia Moore            Computer Graphics
10     P011      Richard Lee                     Robotics
11     P012   Jennifer White   Human-Computer Interaction
12     P013    Thomas Martin              Computer Vision
13     P014  Elizabeth Clark  Natural Language Processing
14     P015   William Wright            Quantum Computing

### 2.Retrieve all projects managed by a specific professor (for example "Robert Brown")

In [6]:

query_projects = "SELECT name, P.pid, P.start_date, P.end_date, P.budget, P.sponsor FROM PROJECT P JOIN Professor prof ON P.ssn = prof.prof_ssn WHERE name = 'Robert Brown';"
cursor.execute(query_projects)
columns = [description[0] for description in cursor.description]
results_df = pd.DataFrame(cursor.fetchall(), columns=columns)
print("Projects managed by Professor: Robert Brown")
display(results_df)

Projects managed by Professor: Robert Brown

           name  pid  start_date    end_date     budget sponsor
0  Robert Brown    3  2023-03-15  2024-03-15  2200000.0  Amazon

### 3.Find the names of graduate students working on a specific project.(For example Project 8)

In [7]:
query_students = "SELECT Grad.name FROM Graduate Grad JOIN Supervises ON  Grad.grad_ssn = Supervises.grad_ssn WHERE pid = '8';"  
cursor.execute(query_students)
columns = [description[0] for description in cursor.description]
results_df = pd.DataFrame(cursor.fetchall(), columns=columns)
print("Graduate students working on Project 8:")
display(results_df)

Graduate students working on Project 8:

               name
0  Nathan Rodriguez
1    Quinn Martinez

### 4. Find professors supervising graduate students on a specific project (for example Project 6).

In [8]:
# 4. Find professors supervising graduate students on a specific project (e.g., project 6)
query_supervisors = "SELECT prof.name FROM Professor prof JOIN Supervises ON prof.prof_ssn = Supervises.prof_ssn WHERE pid='6';" 
cursor.execute(query_supervisors)
columns = [description[0] for description in cursor.description]
results_df = pd.DataFrame(cursor.fetchall(), columns=columns)
print("Professors supervising graduate students working on Project 6:")
display(results_df)

Professors supervising graduate students working on Project 6:

            name
0  Emma Thompson
1  Emma Thompson

### 5. Count how many professors work in each department.

In [9]:
# 5. Count how many professors work in each department
query_dept_count = "SELECT Dept.dno, Dept.dname, COUNT(*) AS professor_count FROM Dept JOIN Work_dept ON Dept.dno = Work_dept.dno GROUP BY Dept.dno, Dept.dname;"
cursor.execute(query_dept_count)
columns = [description[0] for description in cursor.description]
results_df = pd.DataFrame(cursor.fetchall(), columns=columns)
print("Number of professors per department:")
display(results_df)

Number of professors per department:

   dno                    dname  professor_count
0    1         Computer Science                4
1    2             Data Science                5
2    3     Software Engineering                4
3    4            Cybersecurity                4
4    5  Artificial Intelligence                5
5    6                 Robotics                3
6    7            Digital Media                2
7    8      Information Systems                2

### 6.List graduate students and their advisors.

In [10]:
# 6. List graduate students and their advisors
query_advisors = """SELECT g1.name as student, g2.name as advisor FROM Graduate g1 JOIN Advisor a ON g1.grad_ssn = a.grad_ssn JOIN Graduate g2 ON a.senior_ssn = g2.grad_ssn;
"""
cursor.execute(query_advisors)
columns = [description[0] for description in cursor.description]
results_df = pd.DataFrame(cursor.fetchall(), columns=columns)
print("Graduate students and their advisors:")
display(results_df)

Graduate students and their advisors:

            student           advisor
0       Emily Brown       Alex Wilson
1         Grace Liu       Alex Wilson
2         Diana Kim         Chris Lee
3       Isabel Cruz         Chris Lee
4        Kelly Wong        Frank Chen
5    Steven Johnson        Frank Chen
6      Monica Patel        Henry Park
7    Quinn Martinez        Henry Park
8   Olivia Thompson        Jack Zhang
9     Victor Garcia        Jack Zhang
10      Peter Chang      Larry Foster
11       Rachel Kim  Nathan Rodriguez
12         Tina Liu       Peter Chang

### 7.Find all projects with a budget greater than $1,000,000.

In [11]:
query_high_budget = "SELECT * from PROJECT WHERE budget > 1000000;" 
cursor.execute(query_high_budget)
columns = [description[0] for description in cursor.description]
results_df = pd.DataFrame(cursor.fetchall(), columns=columns)
print("High-budget projects (>$1,000,000):")
display(results_df)

High-budget projects (>$1,000,000):

    pid  start_date    end_date     budget   ssn  sponsor
0     1  2023-01-01  2024-01-01  1500000.0  P001   Google
1     3  2023-03-15  2024-03-15  2200000.0  P003   Amazon
2     4  2023-04-01  2024-12-01  2000000.0  P004    Apple
3     6  2023-06-01  2024-08-01  1100000.0  P006      IBM
4     8  2023-08-01  2024-04-01  1300000.0  P008    Intel
5    10  2023-10-01  2024-10-01  1700000.0  P010      AMD
6    11  2023-11-01  2024-11-01  2500000.0  P011    Tesla
7    12  2023-12-01  2024-12-01  1800000.0  P012   SpaceX
8    13  2024-01-01  2025-01-01  1600000.0  P013  Samsung
9    14  2024-02-01  2025-02-01  1900000.0  P014   Huawei
10   15  2024-03-01  2025-03-01  2100000.0  P015     Sony

### 8.Retrieve all departments and their chairmen.

In [12]:
query_chairmen = "SELECT Dept.dno, Dept.dname, Dept.office, Professor.name FROM Dept JOIN Professor ON Dept.prof_ssn = Professor.prof_ssn;"
cursor.execute(query_chairmen)
columns = [description[0] for description in cursor.description]
results_df = pd.DataFrame(cursor.fetchall(), columns=columns)
print("Departments and their chairmen:")
display(results_df)

Departments and their chairmen:

   dno                    dname    office            name
0    1         Computer Science  Room 101      John Smith
1    2             Data Science  Room 201    Mary Johnson
2    3     Software Engineering  Room 301    Robert Brown
3    4            Cybersecurity  Room 401     Sarah Davis
4    5  Artificial Intelligence  Room 501  Michael Wilson
5    6                 Robotics  Room 601     Richard Lee
6    7            Digital Media  Room 701  Patricia Moore
7    8      Information Systems  Room 801    David Miller

### 9.Find the total number of projects a specific professor is managing

In [13]:
query_project_count = "SELECT COUNT(*) AS TotalProjects FROM Project WHERE ssn = 'P001';" 
cursor.execute(query_project_count)
columns = [description[0] for description in cursor.description]
results_df = pd.DataFrame(cursor.fetchall(), columns=columns)
print(f"Number of projects managed by Professor P001:")
display(results_df)

Number of projects managed by Professor P001:

   TotalProjects
0              1

### 10. Find the names of graduate students and their major department.

In [14]:
# 10. Find the names of graduate students and their major department
query_student_dept = "SELECT Graduate.grad_ssn, Graduate.name, Graduate.age, Graduate.deg_prog, Dept.dname FROM Graduate JOIN Dept where major = dno;" # Write your SQL here
cursor.execute(query_student_dept)
columns = [description[0] for description in cursor.description]
results_df = pd.DataFrame(cursor.fetchall(), columns=columns)
print("Graduate students and their departments:")
display(results_df)

Graduate students and their departments:

   grad_ssn              name  age deg_prog                    dname
0      G001       Alex Wilson   25      PhD         Computer Science
1      G002       Emily Brown   23       MS             Data Science
2      G003         Chris Lee   27      PhD     Software Engineering
3      G004         Diana Kim   24       MS            Cybersecurity
4      G005        Frank Chen   26      PhD  Artificial Intelligence
5      G006         Grace Liu   25       MS         Computer Science
6      G007        Henry Park   28      PhD             Data Science
7      G008       Isabel Cruz   24       MS     Software Engineering
8      G009        Jack Zhang   26      PhD            Cybersecurity
9      G010        Kelly Wong   23       MS  Artificial Intelligence
10     G011      Larry Foster   25      PhD                 Robotics
11     G012      Monica Patel   24       MS            Digital Media
12     G013  Nathan Rodriguez   27      PhD      Information Systems
13     G014   Olivia Thompson   26       MS         Computer Science
14     G015       Peter Chang   29      PhD             Data Science
15     G016    Quinn Martinez   23       MS     Software Engineering
16     G017        Rachel Kim   25      PhD            Cybersecurity
17     G018    Steven Johnson   24       MS  Artificial Intelligence
18     G019          Tina Liu   28      PhD                 Robotics
19     G020     Victor Garcia   26       MS            Digital Media

## Closing the database

In [15]:
# Close the connection
connection.close()
print("Database connection closed.")

Database connection closed.